{
  "list": [
    {
      "word": "BATTLE",
      "definition": [
        "A sustained fight between large organized armed forces.",
        "A violent confrontation involving military forces contesting for strategic advantage or territorial control.",
        "An extended engagement where opposing armies clash with significant casualties and resource expenditure."
      ],
      "context": [
        "The Battle of Verdun lasted nearly a year, claiming hundreds of thousands of lives.",
        "Historians debate whether the battle was won through superior tactics or sheer numerical advantage."
      ]
    },
    {
      "word": "ATTACK",
      "definition": [
        "An aggressive action against a person or place to cause damage or injury.",
        "A deliberate offensive operation intended to weaken, destroy, or capture an enemy position.",
        "The initiation of hostile action against a target with intent to harm or neutralize."
      ],
      "context": [
        "The surprise attack at dawn caught the garrison completely unprepared.",
        "Military analysts warned that the attack violated international humanitarian law."
      ]
    },
    {
      "word": "ASSAULT",
      "definition": [
        "A physical attack or threat that causes fear of harm.",
        "A violent and unlawful attack on another person, often involving physical force or weapons.",
        "In military terms, a rapid and concentrated offensive against a fortified position or enemy line."
      ],
      "context": [
        "The assault on the fortress began at midnight with heavy artillery bombardment.",
        "Victims of the assault suffered both physical injuries and lasting psychological trauma."
      ]
    },
    {
      "word": "AMBUSH",
      "definition": [
        "A surprise attack from a concealed position.",
        "A tactical maneuver where forces lie in wait to strike an unsuspecting enemy passing through.",
        "The act of attacking unexpectedly from a hidden location, often to maximize psychological impact and confusion."
      ],
      "context": [
        "The convoy was destroyed in an ambush along the narrow mountain pass.",
        "Guerrilla fighters perfected ambush tactics against conventional military columns."
      ]
    },
    {
      "word": "ARMORY",
      "definition": [
        "A place where weapons and military equipment are stored.",
        "A facility designed for the secure storage, maintenance, and distribution of arms and ammunition.",
        "A fortified building or room containing a collection of weapons and protective equipment for military use."
      ],
      "context": [
        "Rebels raided the armory, seizing enough weapons to arm hundreds of fighters.",
        "The national armory contained stockpiles of weapons dating back decades."
      ]
    },
    {
      "word": "ARSON",
      "definition": [
        "The criminal act of deliberately setting fire to property.",
        "The intentional and malicious burning of buildings or property, often as a weapon of terror or revenge.",
        "A destructive act involving the use of fire to damage or destroy property, frequently employed in warfare and civil unrest."
      ],
      "context": [
        "The retreating army committed arson, leaving entire villages in flames.",
        "Arson attacks against civilian infrastructure are considered war crimes under international law."
      ]
    },
    {
      "word": "BLOCKADE",
      "definition": [
        "An effort to cut off supplies or communication to a place.",
        "A strategic operation preventing goods, people, or communication from entering or leaving a specific area.",
        "The sealing off of a city, port, or region by military force to compel surrender through deprivation."
      ],
      "context": [
        "The naval blockade prevented food and medicine from reaching the besieged population.",
        "Economic blockades can cause widespread suffering among civilian populations."
      ]
    },
    {
      "word": "BOMBING",
      "definition": [
        "The act of attacking with explosive devices.",
        "The delivery of explosives from aircraft or other platforms to destroy targets and terrorize populations.",
        "A method of warfare involving the dropping or detonation of bombs to inflict maximum damage and casualties."
      ],
      "context": [
        "The bombing campaign reduced the city to rubble within weeks.",
        "Survivors described the terror of nightly bombing raids that left thousands dead."
      ]
    },
    {
      "word": "CASUALTY",
      "definition": [
        "A person killed or injured in a war or accident.",
        "Military or civilian personnel who are killed, wounded, missing, or captured during armed conflict.",
        "The human cost of war measured in deaths, injuries, and those rendered unable to continue fighting."
      ],
      "context": [
        "Casualty figures from the offensive remain disputed decades later.",
        "Medics worked frantically to treat the mounting casualties from the artillery barrage."
      ]
    },
    {
      "word": "CAVALRY",
      "definition": [
        "Soldiers who fight mounted on horseback or armored vehicles.",
        "Military units originally composed of mounted troops, now often referring to mechanized or armored divisions.",
        "Mobile fighting forces historically on horses, evolved to include tanks and armored personnel carriers."
      ],
      "context": [
        "The cavalry charge broke through enemy lines in a dramatic display of force.",
        "Modern cavalry units operate armored vehicles rather than horses on the battlefield."
      ]
    },
    {
      "word": "CENSOR",
      "definition": [
        "To suppress or control information, often during wartime.",
        "The official examination and suppression of material deemed sensitive or harmful to state interests.",
        "The practice of restricting access to information, typically to maintain morale or prevent intelligence leaks during conflict."
      ],
      "context": [
        "Military censors redacted letters home to prevent disclosure of troop movements.",
        "The government imposed strict censorship on all media coverage of the invasion."
      ]
    },
    {
      "word": "CHARGE",
      "definition": [
        "A rapid forward attack against an enemy position.",
        "An aggressive rush toward enemy lines with the intent to break through or overwhelm defenses.",
        "A coordinated assault where troops advance at speed, often in the face of heavy fire, to engage in close combat."
      ],
      "context": [
        "The infantry charge was met with devastating machine gun fire from entrenched positions.",
        "Officers ordered a final charge in a desperate attempt to capture the strategic hilltop."
      ]
    },
    {
      "word": "CIVILIAN",
      "definition": [
        "A person not in the armed services or the police force.",
        "Non-combatants who are legally protected from direct attack under international humanitarian law.",
        "Members of the general population not engaged in military activities, often the primary victims of modern warfare."
      ],
      "context": [
        "Civilians bore the brunt of the violence as armies clashed in populated areas.",
        "International law requires parties to a conflict to distinguish between combatants and civilians."
      ]
    },
    {
      "word": "COLONEL",
      "definition": [
        "A senior military officer rank below general.",
        "A commissioned officer typically commanding a regiment or serving in senior staff positions.",
        "A high-ranking officer responsible for tactical command and coordination of military operations."
      ],
      "context": [
        "The colonel briefed his officers on the planned offensive before dawn.",
        "After thirty years of service, she was promoted to the rank of colonel."
      ]
    },
    {
      "word": "CONVOY",
      "definition": [
        "A group of vehicles or ships traveling together for protection.",
        "A formation of transport vehicles or vessels escorted by armed forces to ensure safe passage through hostile territory.",
        "Organized movement of supplies, troops, or equipment traveling in formation to deter or defend against attack."
      ],
      "context": [
        "The humanitarian convoy came under fire despite displaying clear markings.",
        "Naval convoys were essential for transporting supplies across submarine-infested waters."
      ]
    },
    {
      "word": "CRIME",
      "definition": [
        "Violations of law; in wartime can include war crimes.",
        "Acts forbidden by law and punishable by the state, including atrocities committed during armed conflict.",
        "Illegal actions that harm individuals or societies, particularly egregious when committed systematically during war."
      ],
      "context": [
        "The tribunal prosecuted crimes against humanity committed during the occupation.",
        "War crimes included the deliberate targeting of hospitals and schools."
      ]
    },
    {
      "word": "DANGER",
      "definition": [
        "Exposure to harm, risk, or injury.",
        "The possibility of suffering harm or loss, especially prevalent in conflict zones.",
        "A state where individuals or groups face immediate threats to safety and survival."
      ],
      "context": [
        "Civilians living near the border face constant danger from stray artillery fire.",
        "Warning signs marked areas of extreme danger due to unexploded ordnance."
      ]
    },
    {
      "word": "DEATH",
      "definition": [
        "The end of life caused by violence, disease, or accident.",
        "The permanent cessation of all biological functions, often resulting from warfare or violent conflict.",
        "The ultimate consequence of violence, marking the termination of human existence."
      ],
      "context": [
        "Death tolls from the conflict exceeded all initial estimates.",
        "Witnesses described scenes of mass death following the chemical attack."
      ]
    },
    {
      "word": "DEFEAT",
      "definition": [
        "A loss in battle or conflict; the opposite of victory.",
        "The state of being overcome or beaten in combat, resulting in surrender or retreat.",
        "Military failure to achieve objectives, often leading to territorial loss or political consequences."
      ],
      "context": [
        "The crushing defeat forced the army to withdraw beyond the border.",
        "Historians debate whether the defeat was inevitable or preventable."
      ]
    },
    {
      "word": "DEFUSE",
      "definition": [
        "To make a dangerous situation safe, such as disarming explosives.",
        "The careful process of rendering bombs or mines inoperative to prevent detonation.",
        "To reduce tension or danger in a volatile situation before it escalates into violence."
      ],
      "context": [
        "Bomb disposal experts worked carefully to defuse the improvised explosive device.",
        "Diplomats attempted to defuse the crisis through emergency negotiations."
      ]
    },
    {
      "word": "DEPLOY",
      "definition": [
        "To position troops or resources for military action.",
        "The strategic movement and placement of forces in preparation for operations.",
        "To bring military units into effective action at designated locations."
      ],
      "context": [
        "The general ordered troops to deploy along the contested frontier.",
        "Rapid deployment capabilities proved decisive in the early stages of the conflict."
      ]
    },
    {
      "word": "DESERT",
      "definition": [
        "To abandon a post or duty.",
        "The act of leaving military service without permission, often punishable by court-martial.",
        "To forsake one's obligations or comrades, typically in the face of danger or hardship."
      ],
      "context": [
        "Soldiers began to desert in large numbers as conditions deteriorated.",
        "Desertion rates spiked after the disastrous offensive."
      ]
    },
    {
      "word": "DYNAMITE",
      "definition": [
        "An explosive used to demolish.",
        "A powerful blasting material invented for construction but frequently weaponized in warfare.",
        "High-explosive compound used to destroy structures, fortifications, and infrastructure."
      ],
      "context": [
        "Sappers used dynamite to blow up the bridge and prevent enemy advance.",
        "Guerrillas stockpiled dynamite stolen from mining operations for their attacks."
      ]
    },
    {
      "word": "EMBARGO",
      "definition": [
        "An official ban on trade with a particular country.",
        "Economic sanctions prohibiting commerce as a tool of political pressure or punishment.",
        "Government-imposed restriction on the import or export of goods to influence foreign policy."
      ],
      "context": [
        "The embargo crippled the economy and caused widespread shortages.",
        "International embargoes failed to prevent arms from reaching the warring factions."
      ]
    },
    {
      "word": "EXODUS",
      "definition": [
        "A mass departure of people, often refugees fleeing violence.",
        "The large-scale migration of populations escaping war, persecution, or disaster.",
        "A forced displacement where entire communities abandon their homes seeking safety elsewhere."
      ],
      "context": [
        "The exodus of refugees overwhelmed neighboring countries' capacity to provide aid.",
        "Thousands joined the exodus, carrying only what they could carry on their backs."
      ]
    },
    {
      "word": "FALLEN",
      "definition": [
        "Those who have died in combat; casualties.",
        "Soldiers killed in action, honored and mourned by their nations.",
        "The dead from military service, often commemorated in memorials and ceremonies."
      ],
      "context": [
        "The memorial wall bears the names of thousands of fallen soldiers.",
        "Families of the fallen received medals posthumously awarded for valor."
      ]
    },
    {
      "word": "FASCISM",
      "definition": [
        "An authoritarian and nationalistic right-wing system of government.",
        "A totalitarian political ideology emphasizing dictatorial power, forcible suppression of opposition, and strong regimentation of society.",
        "An extreme form of nationalism often involving militarism, racism, and the glorification of violence."
      ],
      "context": [
        "Fascism rose to power through a combination of propaganda and political violence.",
        "The regime's fascist ideology justified aggressive expansion and persecution of minorities."
      ]
    },
    {
      "word": "FIGHTER",
      "definition": [
        "A person or animal that fights.",
        "An individual engaged in combat, whether as a soldier, insurgent, or warrior.",
        "Military aircraft designed for air-to-air combat against enemy planes."
      ],
      "context": [
        "Fighter jets scrambled to intercept the approaching enemy bombers.",
        "The resistance recruited young fighters from villages throughout the region."
      ]
    },
    {
      "word": "FIREARM",
      "definition": [
        "A portable gun.",
        "A weapon that uses explosive force to propel projectiles at high velocity.",
        "Any handheld weapon capable of discharging bullets or shot through a barrel."
      ],
      "context": [
        "The proliferation of illegal firearms fueled the insurgency.",
        "Firearm regulations were suspended during the state of emergency."
      ]
    },
    {
      "word": "FORCED",
      "definition": [
        "Made to do something against one's will.",
        "Compelled through violence, coercion, or threat to act contrary to one's desires.",
        "Involving the use of physical power or intimidation to achieve compliance."
      ],
      "context": [
        "Civilians were forced to flee their homes under threat of violence.",
        "Forced conscription violated international human rights standards."
      ]
    },
    {
      "word": "FRONTLINE",
      "definition": [
        "The military line or part of an army that is closest to the enemy.",
        "The most forward position in a battle or war zone where direct combat occurs.",
        "The boundary between opposing forces where fighting is most intense and dangerous."
      ],
      "context": [
        "Conditions on the frontline were brutal, with constant bombardment and shortages.",
        "Journalists risked their lives to report from the frontline of the conflict."
      ]
    },
    {
      "word": "GARRISON",
      "definition": [
        "Troops stationed to defend an area.",
        "A military post where soldiers are permanently stationed to maintain control of a territory.",
        "The body of troops assigned to guard a fortification, town, or strategic location."
      ],
      "context": [
        "The garrison held out for weeks despite being cut off from supplies.",
        "Reinforcements arrived to strengthen the garrison defending the critical port city."
      ]
    },
    {
      "word": "GENOCIDE",
      "definition": [
        "The deliberate killing of a large group of people.",
        "The systematic destruction of a national, ethnic, racial, or religious group through mass murder.",
        "A crime under international law involving the intent to destroy, in whole or part, a population."
      ],
      "context": [
        "The genocide was meticulously planned and executed over several months.",
        "International courts prosecuted military leaders for their role in the genocide.",
        "Survivors testified about the horrors they witnessed during the genocide."
      ]
    },
    {
      "word": "GRENADE",
      "definition": [
        "A small bomb thrown by hand or launched mechanically.",
        "An explosive weapon designed to fragment upon detonation, causing casualties within a radius.",
        "A handheld munition that can be thrown or fired to deliver explosive force against enemy positions."
      ],
      "context": [
        "Soldiers lobbed grenades into the bunker before storming the position.",
        "The explosion from the grenade left a crater in the street and shattered nearby windows."
      ]
    },
    {
      "word": "GUNNER",
      "definition": [
        "A soldier who operates a gun or artillery.",
        "A military specialist trained in the use of heavy weapons, cannons, or mounted guns.",
        "The crew member responsible for aiming and firing weapons on vehicles or aircraft."
      ],
      "context": [
        "The gunner adjusted the artillery trajectory for maximum impact on enemy trenches.",
        "Aircraft gunners defended bombers from attacking fighter planes during missions."
      ]
    },
    {
      "word": "HOSTILE",
      "definition": [
        "Unfriendly; antagonistic.",
        "Showing opposition or resistance, particularly in military or political contexts.",
        "Characterized by enmity and readiness for conflict or aggression."
      ],
      "context": [
        "The patrol entered hostile territory without adequate reconnaissance.",
        "Hostile actions by both sides escalated tensions beyond the point of negotiation."
      ]
    },
    {
      "word": "HURTLE",
      "definition": [
        "To move at high speed; used for projectiles.",
        "To rush violently or with great force, often describing bullets, missiles, or shrapnel.",
        "To be propelled rapidly through the air, typically in a dangerous or uncontrolled manner."
      ],
      "context": [
        "Shrapnel hurtled through the air after the bomb detonated in the crowded market.",
        "The missile hurtled toward its target at supersonic speed."
      ]
    },
    {
      "word": "INVADE",
      "definition": [
        "To enter a country or place by force.",
        "To launch a military assault with the intent to occupy or conquer territory.",
        "The act of intruding upon and taking control of another nation's sovereign land."
      ],
      "context": [
        "The decision to invade violated multiple international treaties.",
        "Forces began to invade at dawn, catching defenders off guard."
      ]
    },
    {
      "word": "INSURGENT",
      "definition": [
        "A rebel fighting established authority.",
        "A person who rises in revolt against civil authority or an occupying power.",
        "Armed fighters engaged in irregular warfare against government forces or foreign occupation."
      ],
      "context": [
        "Insurgent attacks targeted supply convoys and communication infrastructure.",
        "The insurgent movement gained popular support after government crackdowns."
      ]
    },
    {
      "word": "JOSTLE",
      "definition": [
        "To push or shove roughly in chaotic settings.",
        "To compete aggressively for position or advantage, often in crowded or violent situations.",
        "Physical pushing and bumping that occurs in panicked crowds or during civil unrest."
      ],
      "context": [
        "Refugees jostled desperately to board the evacuation trains.",
        "Protesters and police jostled violently as the demonstration turned chaotic."
      ]
    },
    {
      "word": "KILLED",
      "definition": [
        "Having been caused to die; result of lethal violence.",
        "Deprived of life through deliberate action, accident, or armed conflict.",
        "The state of being dead as a consequence of violence or warfare."
      ],
      "context": [
        "Hundreds were killed in the indiscriminate shelling of the city.",
        "The report confirmed that civilians were killed in violation of international law."
      ]
    },
    {
      "word": "KIDNAP",
      "definition": [
        "To take someone away illegally by force.",
        "The abduction of individuals for ransom, political leverage, or other criminal purposes.",
        "Forcible seizure and detention of persons against their will, often in conflict zones."
      ],
      "context": [
        "Armed groups kidnapped aid workers to demand prisoner releases.",
        "Families paid exorbitant ransoms to secure the release of kidnapped relatives."
      ]
    },
    {
      "word": "LAUNCH",
      "definition": [
        "To set an attack, missile, or operation into motion.",
        "To initiate a military offensive or fire a weapon toward a target.",
        "The act of beginning a coordinated assault or deploying projectile weapons."
      ],
      "context": [
        "The military prepared to launch a preemptive strike at first light.",
        "Intelligence reports warned that enemy forces were ready to launch their offensive."
      ]
    },
    {
      "word": "MASSACRE",
      "definition": [
        "The brutal killing of many people.",
        "An indiscriminate and savage slaughter of large numbers, often unarmed civilians.",
        "A war crime involving the deliberate mass murder of defenseless populations."
      ],
      "context": [
        "The massacre shocked the international community and prompted calls for intervention.",
        "Survivors of the massacre bore physical and psychological scars for life.",
        "Historical records document the massacre in harrowing detail."
      ]
    },
    {
      "word": "MINEFIELD",
      "definition": [
        "An area planted with explosive mines.",
        "Territory deliberately sown with buried explosives to deny access or cause casualties.",
        "A hazardous zone where concealed mines pose lethal danger to anyone who enters."
      ],
      "context": [
        "The minefield claimed dozens of victims, including children playing near the border.",
        "Clearing the minefield required years of painstaking and dangerous work."
      ]
    },
    {
      "word": "MOBBED",
      "definition": "Attacked or overwhelmed by a crowd; mob violence.",
      "context": [
        "The politician was mobbed by angry protesters demanding accountability for war crimes.",
        "Aid workers were mobbed by desperate crowds seeking food and medical supplies."
      ]
    },
    {
      "word": "MORTAR",
      "definition": "A short artillery piece used to fire explosive shells.",
      "context": [
        "Mortar fire rained down on the city throughout the night, causing widespread destruction.",
        "Troops set up mortar positions on the hilltop to bombard enemy encampments below."
      ]
    },
    {
      "word": "MURDER",
      "definition": "The unlawful killing of another person with intent.",
      "context": [
        "The tribunal charged military officers with the murder of unarmed civilians.",
        "Witnesses testified about the systematic murder of prisoners held in detention camps.",
        "Mass murder characterized the darkest days of the conflict."
      ]
    },
    {
      "word": "NAPALM",
      "definition": "An incendiary substance used in warfare.",
      "context": [
        "Napalm strikes devastated entire villages, leaving survivors with horrific burns.",
        "The use of napalm against civilian populations was widely condemned as inhumane."
      ]
    },
    {
      "word": "NATIONALISM",
      "definition": "Strong identification with one's nation.",
      "context": [
        "Extreme nationalism fueled aggressive territorial expansion and ethnic cleansing.",
        "Political leaders exploited nationalism to justify military intervention in neighboring states."
      ]
    },
    {
      "word": "OCCUPY",
      "definition": "To take control of a place by military force.",
      "context": [
        "Enemy forces moved to occupy the capital after defeating government troops.",
        "The occupation lasted for years, imposing martial law on the subjugated population."
      ]
    },
    {
      "word": "OFFENSE",
      "definition": "An aggressive military operation.",
      "context": [
        "The spring offense aimed to recapture territory lost during the previous year.",
        "Commanders planned a major offense to break the stalemate along the frontline."
      ]
    },
    {
      "word": "PATROL",
      "definition": "A group sent out to monitor an area for security.",
      "context": [
        "The patrol encountered enemy scouts while sweeping the perimeter of the base.",
        "Night patrols were particularly dangerous due to the risk of ambush in darkness."
      ]
    },
    {
      "word": "PILLAGE",
      "definition": "To rob a place using violence.",
      "context": [
        "Retreating armies pillaged villages, stealing valuables and destroying what they couldn't carry.",
        "Historical accounts describe the systematic pillage of conquered cities by invading forces."
      ]
    },
    {
      "word": "POISON",
      "definition": "A substance that can cause harm or death.",
      "context": [
        "Chemical weapons poisoned entire regions, contaminating water supplies for decades.",
        "Assassination attempts using poison have been documented throughout military history."
      ]
    },
    {
      "word": "PRISON",
      "definition": "A place where captives or detainees are held.",
      "context": [
        "Prisoners of war endured brutal conditions in makeshift prison camps.",
        "The prison held political dissidents and captured enemy combatants in separate wings."
      ]
    },
    {
      "word": "PROVOCATION",
      "definition": "Action intended to elicit a hostile response.",
      "context": [
        "Border incursions were seen as deliberate provocations designed to test military readiness.",
        "The provocation sparked a crisis that nearly escalated into full-scale war."
      ]
    },
    {
      "word": "RADICAL",
      "definition": "A person or idea seeking extreme change, sometimes violent.",
      "context": [
        "Radical factions rejected peace negotiations and vowed to continue armed struggle.",
        "The movement attracted radicals willing to use violence to achieve political goals."
      ]
    },
    {
      "word": "RAPIER",
      "definition": "A slender, pointed sword used historically in combat.",
      "context": [
        "Officers carried rapiers as symbols of rank and for close-quarters combat.",
        "The rapier was favored in duels for its precision and deadly thrusting capability."
      ]
    },
    {
      "word": "RAIDED",
      "definition": "To attack or invade suddenly and briefly.",
      "context": [
        "Special forces raided the compound under cover of darkness to rescue hostages.",
        "Coastal towns were frequently raided by pirates seeking plunder and captives."
      ]
    },
    {
      "word": "RANSOM",
      "definition": [
        "Payment demanded for the release of a captive.",
        "Money or compensation required by kidnappers or hostage-takers to free prisoners.",
        "A sum of money extorted in exchange for the release of detained individuals or return of property."
      ],
      "context": [
        "The ransom demand exceeded one million dollars for the safe return of the diplomats.",
        "Negotiators worked to reduce the ransom while ensuring the hostages remained unharmed.",
        "Families struggled to gather the ransom demanded by the insurgent group."
      ]
    },
    {
      "word": "REFUGEE",
      "definition": [
        "A person forced to flee due to war.",
        "Individuals displaced from their homeland by armed conflict, persecution, or violence.",
        "Those seeking asylum and safety in foreign countries after escaping war-torn regions."
      ],
      "context": [
        "Refugee camps along the border housed thousands fleeing the violence.",
        "International organizations provided aid to refugees crossing into neighboring countries.",
        "The refugee crisis overwhelmed reception centers as families arrived daily seeking shelter."
      ]
    },
    {
      "word": "SABOTAGE",
      "definition": [
        "Deliberate destruction or obstruction.",
        "The intentional undermining of operations, equipment, or infrastructure to hinder an enemy.",
        "Covert action to damage or disrupt military or industrial capacity during conflict."
      ],
      "context": [
        "Resistance fighters engaged in sabotage operations against railway lines and power stations.",
        "The sabotage of the fuel depot delayed the enemy's advance by several weeks.",
        "Intelligence agencies trained operatives in sabotage techniques for behind-the-lines missions."
      ]
    },
    {
      "word": "SIEGE",
      "definition": [
        "Surrounding and isolating a place to compel surrender.",
        "A prolonged military blockade of a city or fortress with the intent to force capitulation through starvation or assault.",
        "The encirclement and sustained attack on a defended position to capture it or force its occupants to yield."
      ],
      "context": [
        "The siege lasted nine months before the garrison finally surrendered due to lack of food.",
        "Medieval siege warfare involved battering rams, catapults, and deliberate starvation tactics.",
        "Civilians trapped inside the city endured horrific conditions during the prolonged siege."
      ]
    },
    {
      "word": "SHELL",
      "definition": [
        "Explosive artillery ammunition used to bombard positions.",
        "A hollow projectile filled with explosives, fired from artillery pieces or mortars.",
        "Large-caliber munitions designed to detonate on impact or in the air, causing widespread damage and casualties."
      ],
      "context": [
        "Artillery shells rained down on the trenches throughout the night, killing dozens.",
        "The shell burst overhead, sending deadly shrapnel in all directions.",
        "Unexploded shells remained buried in the soil decades after the war ended, posing ongoing danger."
      ]
    },
    {
      "word": "SLAYED",
      "definition": [
        "Killed violently; to slay someone is to murder them.",
        "Put to death through deliberate and often brutal means.",
        "The act of killing, especially in battle or through violent confrontation."
      ],
      "context": [
        "Hundreds were slayed in the massacre that followed the city's capture.",
        "Legends tell of warriors who slayed enemies in single combat to decide battles.",
        "Entire villages were slayed as invading armies advanced through the countryside."
      ]
    },
    {
      "word": "SNIPER",
      "definition": [
        "A marksman who shoots from concealed positions at long range.",
        "A highly trained shooter who engages targets from hidden locations using precision rifles.",
        "A soldier specializing in eliminating high-value targets from great distances without being detected."
      ],
      "context": [
        "The sniper remained motionless for hours, waiting for the perfect shot at the enemy commander.",
        "Sniper fire pinned down the patrol, forcing them to take cover behind abandoned vehicles.",
        "Counter-sniper teams were deployed to locate and eliminate the threat terrorizing the streets."
      ]
    },
    {
      "word": "STRIKE",
      "definition": [
        "A sudden attack, often by air or missile.",
        "A coordinated military assault designed to hit specific targets with precision and speed.",
        "An offensive action, particularly airstrikes or missile attacks, to destroy enemy capabilities."
      ],
      "context": [
        "The air strike destroyed the weapons facility in the early morning hours.",
        "Precision strikes targeted command and control centers to disrupt enemy operations.",
        "Retaliatory strikes were launched within hours of the initial attack on border positions."
      ]
    },
    {
      "word": "SUBDUE",
      "definition": [
        "To bring under control or suppress by force.",
        "To overcome resistance and establish dominance through military or physical power.",
        "To conquer and pacify opposition, often involving the use of violence to achieve submission."
      ],
      "context": [
        "Troops were ordered to subdue the rebellion using whatever force necessary.",
        "It took months of brutal fighting to subdue the insurgent-held territories.",
        "Police and military units worked together to subdue riots in the capital."
      ]
    },
    {
      "word": "SUPPLY",
      "definition": [
        "Provision of equipment, food, or ammunition for operations.",
        "The logistics of delivering necessary materials, weapons, and resources to military forces.",
        "Essential goods and materiel required to sustain troops and maintain combat readiness."
      ],
      "context": [
        "Supply lines were cut off, leaving the besieged garrison without food or ammunition.",
        "Aerial supply drops became the only way to provision troops trapped behind enemy lines.",
        "Controlling supply routes proved decisive in determining the outcome of the campaign."
      ]
    },
    {
      "word": "SURRENDER",
      "definition": "To give up or cease resistance."
    },
    {
      "word": "TRENCH",
      "definition": "A long ditch used to protect soldiers from enemy fire."
    },
    {
      "word": "TERROR",
      "definition": "Acts intended to create fear and coerce populations."
    },
    {
      "word": "TORTURE",
      "definition": "Inflicting severe pain to punish or extract information."
    },
    {
      "word": "TORPEDO",
      "definition": "A self-propelled underwater missile used to destroy ships."
    },
    {
      "word": "UNREST",
      "definition": "A state of disturbance often leading to protests or violence."
    },
    {
      "word": "UPRISING",
      "definition": "A revolt or rebellion."
    },
    {
      "word": "VANDALISM",
      "definition": "Deliberate destruction of property."
    },
    {
      "word": "VASSAL",
      "definition": "A state or person in a subordinate position to a ruler."
    },
    {
      "word": "VICTIM",
      "definition": "A person harmed or killed as a result of violence."
    },
    {
      "word": "VIOLENCE",
      "definition": "Behavior involving physical force."
    },
    {
      "word": "VIOLATION",
      "definition": "The act of breaking laws or rights."
    },
    {
      "word": "WARBAND",
      "definition": "A group organized for waging war."
    },
    {
      "word": "WARLORD",
      "definition": "A leader controlling territory by force."
    },
    {
      "word": "WEAPON",
      "definition": "Tools used to inflict harm."
    },
    {
      "word": "WOUNDED",
      "definition": "Persons injured in combat or violent incidents."
    },
    {
      "word": "WRATH",
      "definition": "Extreme anger or violent retribution."
    },
    {
      "word": "GUNSHIP",
      "definition": "A heavily armed military aircraft used for close air support."
    },
    {
      "word": "AIRRAID",
      "definition": "An attack by military aircraft."
    },
    {
      "word": "MILITIA",
      "definition": "A group of civilian fighters organized for military service."
    },
    {
      "word": "BUNKER",
      "definition": "A strong defensive fortification, often underground."
    },
    {
      "word": "OUTPOST",
      "definition": "A small military station distant from the main force."
    },
    {
      "word": "RETREAT",
      "definition": "A withdrawal of troops to avoid defeat or regroup."
    },
    {
      "word": "RAIDERS",
      "definition": "Forces conducting sudden attacks to harass or loot."
    },
    {
      "word": "SOLDIER",
      "definition": "An individual who serves in an army and engages in combat."
    },
    {
      "word": "BARRACK",
      "definition": "Buildings used to house soldiers or military personnel."
    },
    {
      "word": "BOMBARD",
      "definition": "To attack persistently with artillery or bombs."
    },
    {
      "word": "INVADER",
      "definition": "An armed force or person that enters by force to occupy."
    },
    {
      "word": "CAPTURE",
      "definition": "To take control of a person, place, or thing by force."
    },
    {
      "word": "HOSTAGE",
      "definition": "A person held to secure the fulfillment of terms."
    },
    {
      "word": "ESCAPE",
      "definition": "To break free from confinement or dangerous situation."
    },
    {
      "word": "BLOCKER",
      "definition": "An entity that obstructs movement or supply lines."
    },
    {
      "word": "BULLETS",
      "definition": "Small metal projectiles fired from firearms."
    },
    {
      "word": "BAYONET",
      "definition": "A blade attached to the muzzle of a rifle for close combat."
    },
    {
      "word": "CROSSHAIR",
      "definition": "Aiming reticle used in firearms optics."
    },
    {
      "word": "DEBRIS",
      "definition": "Scattered fragments from destruction or explosion."
    },
    {
      "word": "DEMOLITION",
      "definition": "Deliberate destruction of structures."
    },
    {
      "word": "ENLISTEE",
      "definition": "A person who joins the armed forces."
    },
    {
      "word": "EXCHANGE",
      "definition": "Trade or swap; in war, sometimes of prisoners or territory."
    },
    {
      "word": "FALLBACK",
      "definition": "A planned withdrawal to a more defensible position."
    },
    {
      "word": "FIRESTORM",
      "definition": "An intense fire spread over an area."
    },
    {
      "word": "FLANKED",
      "definition": "Attacked from the side or exposed to side attack."
    },
    {
      "word": "FORCEFUL",
      "definition": "Involving the use of physical power."
    },
    {
      "word": "GRENADIER",
      "definition": "A soldier specialized with grenades or assault roles."
    },
    {
      "word": "HARBOR",
      "definition": "A sheltered area for ships; strategic naval target."
    },
    {
      "word": "HOSTILE",
      "definition": "Unfriendly or antagonistic, often in military context."
    },
    {
      "word": "IMPACTS",
      "definition": "Forceful strikes or collisions causing damage."
    },
    {
      "word": "INFANTRY",
      "definition": "Foot soldiers engaged in ground combat."
    },
    {
      "word": "INTIMIDATE",
      "definition": "To frighten or coerce by threats or force."
    },
    {
      "word": "JIHADIST",
      "definition": "Refers to fighters practicing jihad; can be violent militants."
    },
    {
      "word": "KRAKEN",
      "definition": "Mythical sea monster; used metaphorically for destructive forces."
    },
    {
      "word": "LOCKOUT",
      "definition": "To prevent access; in war can mean sealing an area."
    },
    {
      "word": "MARAUDER",
      "definition": "A raider who plunders."
    },
    {
      "word": "NOMADS",
      "definition": "Groups displaced by conflict moving without a fixed home."
    },
    {
      "word": "OCCUPIED",
      "definition": "Held and controlled by a foreign force."
    },
    {
      "word": "PILGRIM",
      "definition": "Displaced people traveling."
    },
    {
      "word": "QUARTER",
      "definition": "Providing mercy or shelter; sometimes denied in warfare."
    },
    {
      "word": "RAPTOR",
      "definition": "Predatory aircraft or metaphor for aggressive force."
    },
    {
      "word": "SANDBAG",
      "definition": "A bag filled with sand used for protection against blasts."
    },
    {
      "word": "SIEGECRAFT",
      "definition": "Methods used to conduct a siege."
    },
    {
      "word": "TANK",
      "definition": "Armored combat vehicles used on the battlefield."
    },
    {
      "word": "UPROOT",
      "definition": "To displace or remove people from their homes."
    },
    {
      "word": "VICIOUS",
      "definition": "Cruelly violent or aggressive behavior."
    },
    {
      "word": "WARFARE",
      "definition": "Engagements between armed forces using organized violence."
    },
    {
      "word": "XENOPHOBIA",
      "definition": "Fear of foreigners that can lead to violence."
    },
    {
      "word": "YIELD",
      "definition": "To give way under pressure; surrender in conflict contexts."
    },
    {
      "word": "ZEALOT",
      "definition": "An extremist committed to an ideology, sometimes violently."
    },
    {
      "word": "AIRDROP",
      "definition": "Delivery of supplies or equipment by aircraft into a combat zone."
    },
    {
      "word": "BACKFIRE",
      "definition": "An attack or plan that has the opposite effect intended."
    },
    {
      "word": "BARRAGE",
      "definition": "A concentrated artillery bombardment over a wide area."
    },
    {
      "word": "BASHING",
      "definition": "Violent beating or assault by a group or individual."
    },
    {
      "word": "BERSERK",
      "definition": "Acting in a frenzied or uncontrolled violent manner."
    },
    {
      "word": "BURNOUT",
      "definition": "Destruction by fire or exhaustion of resources in conflict."
    },
    {
      "word": "BOMBER",
      "definition": "A military aircraft designed to drop bombs."
    },
    {
      "word": "BRIGADE",
      "definition": "A major tactical military formation that is typically composed of three to six battalions."
    },
    {
      "word": "BULLET",
      "definition": "A projectile for firing from a rifle, revolver, or other small firearm."
    },
    {
      "word": "CANNON",
      "definition": "A large, heavy piece of artillery, typically mounted on wheels."
    },
    {
      "word": "COMBAT",
      "definition": "Fighting between armed forces."
    },
    {
      "word": "COMMANDO",
      "definition": "A soldier specially trained to carry out raids."
    },
    {
      "word": "CONFLICT",
      "definition": "A serious disagreement or clash, often armed."
    },
    {
      "word": "CRUSADE",
      "definition": "A vigorous campaign for some cause, historically violent."
    },
    {
      "word": "DEFENSE",
      "definition": "The action of defending from or resisting attack."
    },
    {
      "word": "DEMOLISH",
      "definition": "To destroy or ruin a building or structure, often in war."
    },
    {
      "word": "DETENTION",
      "definition": "The act of holding someone in custody."
    },
    {
      "word": "ENEMY",
      "definition": "A person who is actively opposed or hostile to someone or something."
    },
    {
      "word": "EXPLOSION",
      "definition": "A violent and destructive shattering or blowing apart of something."
    },
    {
      "word": "FIRESTORM",
      "definition": "An intense fire spread over an area."
    },
    {
      "word": "FLANK",
      "definition": "The side of a person's or animal's body between the ribs and the hip."
    },
    {
      "word": "FORTRESS",
      "definition": "A military stronghold."
    },
    {
      "word": "GENOCIDE",
      "definition": "The deliberate killing of a large group of people."
    },
    {
      "word": "GUARD",
      "definition": "A person who keeps watch, especially a soldier or other person assigned to protect a person or to control access to a place."
    },
    {
      "word": "GUNFIRE",
      "definition": "The shooting of guns."
    },
    {
      "word": "GUNMAN",
      "definition": "A man who uses a gun to commit a crime or terrorist act."
    },
    {
      "word": "GUNSHOT",
      "definition": "A shot fired from a gun."
    },
    {
      "word": "HELMET",
      "definition": "A hard or padded protective hat."
    },
    {
      "word": "INJURY",
      "definition": "Harm or damage."
    },
    {
      "word": "INSURGENCY",
      "definition": "An active revolt or uprising."
    },
    {
      "word": "JETFIGHTER",
      "definition": "A fast military aircraft designed for air-to-air combat."
    },
    {
      "word": "KILLING",
      "definition": "The act of causing death, especially deliberately."
    },
    {
      "word": "LANDMINE",
      "definition": "An explosive mine laid on or just under the surface of the ground."
    },
    {
      "word": "LEADER",
      "definition": "The person who leads or commands a group, organization, or country."
    },
    {
      "word": "MACHINEGUN",
      "definition": "An automatic gun that fires bullets in rapid succession."
    },
    {
      "word": "MEDAL",
      "definition": "A metal disc typically of the kind awarded for bravery or service in war."
    },
    {
      "word": "MILITARY",
      "definition": "The armed forces of a country."
    },
    {
      "word": "MISSILE",
      "definition": "A weapon that is self-propelled or directed by remote control."
    },
    {
      "word": "MISSION",
      "definition": "An important assignment carried out for political, religious, or commercial purposes."
    },
    {
      "word": "NAVY",
      "definition": "The branch of a nation's armed services that conducts military operations at sea."
    },
    {
      "word": "OFFENSIVE",
      "definition": "An attacking military campaign."
    },
    {
      "word": "OPPONENT",
      "definition": "Someone who competes against or fights another in a contest, game, or argument."
    },
    {
      "word": "PARADE",
      "definition": "A public procession, especially one celebrating a special day or event including military."
    },
    {
      "word": "PARATROOPER",
      "definition": "A member of a group of soldiers trained to parachute from aircraft."
    },
    {
      "word": "PEACEKEEPER",
      "definition": "A person who maintains or restores peace and order."
    },
    {
      "word": "PILOT",
      "definition": "A person who operates the flying controls of an aircraft."
    },
    {
      "word": "PLATOON",
      "definition": "A subdivision of a company of soldiers."
    },
    {
      "word": "PRISONER",
      "definition": "A person legally held in prison as a punishment for crimes committed or while awaiting trial."
    },
    {
      "word": "PROTEST",
      "definition": "A statement or action expressing disapproval of or objection to something."
    },
    {
      "word": "RADAR",
      "definition": "A system for detecting the presence, direction, distance, and speed of objects."
    },
    {
      "word": "RAMPAGE",
      "definition": "A period of violent and uncontrollable behavior."
    },
    {
      "word": "REBELLION",
      "definition": "An act of violent or open resistance to an established government or ruler."
    },
    {
      "word": "REGIMENT",
      "definition": "A permanent unit of an army."
    },
    {
      "word": "RESCUE",
      "definition": "To save someone from a dangerous or distressing situation."
    },
    {
      "word": "REVOLT",
      "definition": "Rise in rebellion."
    },
    {
      "word": "REVOLUTION",
      "definition": "A forcible overthrow of a government or social order."
    },
    {
      "word": "RIFLE",
      "definition": "A gun, especially one fired from shoulder level."
    },
    {
      "word": "ROCKET",
      "definition": "A missile, spacecraft, aircraft or other vehicle that obtains thrust from a rocket engine."
    },
    {
      "word": "SACRIFICE",
      "definition": "An act of giving up something valued for the sake of something else."
    },
    {
      "word": "SARGEANT",
      "definition": "A non-commissioned officer in the armed forces."
    },
    {
      "word": "SHOOTER",
      "definition": "A person who uses a gun."
    },
    {
      "word": "SHRAPNEL",
      "definition": "Fragments of a bomb, shell, or other object thrown out by an explosion."
    },
    {
      "word": "SILENCER",
      "definition": "A device for reducing the noise emitted by a gun."
    },
    {
      "word": "SLAUGHTER",
      "definition": "The killing of animals for food; or killing of people in a cruel or violent way."
    },
    {
      "word": "SQUAD",
      "definition": "A small group of people having a particular task."
    },
    {
      "word": "STRATEGY",
      "definition": "A plan of action designed to achieve a long-term or overall aim."
    },
    {
      "word": "SUBMARINE",
      "definition": "A warship with a streamlined hull designed to operate underwater."
    },
    {
      "word": "SURVIVOR",
      "definition": "A person who survives, especially a person remaining alive after an event in which others have died."
    },
    {
      "word": "TACTIC",
      "definition": "An action or strategy carefully planned to achieve a specific end."
    },
    {
      "word": "TANK",
      "definition": "A heavy armored fighting vehicle carrying guns and moving on a continuous articulated metal track."
    },
    {
      "word": "TERRORISM",
      "definition": "The unlawful use of violence and intimidation, especially against civilians."
    },
    {
      "word": "TERRORIST",
      "definition": "A person who uses unlawful violence and intimidation."
    },
    {
      "word": "TRAITOR",
      "definition": "A person who betrays someone or something."
    },
    {
      "word": "TRAP",
      "definition": "A device or enclosure designed to catch and retain animals or people."
    },
    {
      "word": "TROOP",
      "definition": "Soldiers or armed forces."
    },
    {
      "word": "TROPHY",
      "definition": "A cup or other decorative object awarded as a prize for a victory or success."
    },
    {
      "word": "TURRET",
      "definition": "A small tower on top of a larger tower or at the corner of a building or wall."
    },
    {
      "word": "UNIFORM",
      "definition": "The distinctive clothing worn by members of the same organization or body."
    },
    {
      "word": "VEHICLE",
      "definition": "A thing used for transporting people or goods."
    },
    {
      "word": "VICTORY",
      "definition": "An act of defeating an enemy or opponent in a battle, game, or other competition."
    },
    {
      "word": "WARFARE",
      "definition": "Engagement in or the activities involved in war or conflict."
    },
    {
      "word": "WARHEAD",
      "definition": "The explosive head of a missile, torpedo, or similar weapon."
    },
    {
      "word": "WARLORD",
      "definition": "A military commander, especially an aggressive regional commander with individual autonomy."
    },
    {
      "word": "WARRIOR",
      "definition": "A brave or experienced soldier or fighter."
    },
    {
      "word": "WEAPON",
      "definition": "A thing designed or used for inflicting bodily harm or physical damage."
    },
    {
      "word": "WOUNDED",
      "definition": "Injured, especially with a cut or other injury to the body."
    },
    {
      "word": "ZEPPELIN",
      "definition": "A large German dirigible airship of the early 20th century."
    },
    {
      "word": "IMPERIALISM",
      "definition": "A policy of extending a country's power and influence through diplomacy or military force."
    },
    {
      "word": "MILITARIZATION",
      "definition": "The process by which a society organizes itself for military conflict and violence."
    },
    {
      "word": "REVOLUTIONARY",
      "definition": "Involving or causing a complete or dramatic change, often through force."
    },
    {
      "word": "COUNTERINSURGENCY",
      "definition": "Military or political action taken against the activities of guerrillas or revolutionaries."
    },
    {
      "word": "PROPAGANDIST",
      "definition": "A person who promotes or publicizes a particular cause or ideology, often in war."
    },
    {
      "word": "INTERVENTIONISM",
      "definition": "The policy of intervening in the affairs of another country."
    },
    {
      "word": "RECONNAISSANCE",
      "definition": "Military observation of a region to locate an enemy or ascertain strategic features."
    },
    {
      "word": "DISINFORMATION",
      "definition": "False information spread deliberately to deceive, often used in geopolitical conflicts."
    },
    {
      "word": "COLONIZATION",
      "definition": "The act of setting up a colony away from one's place of origin, often by force."
    },
    {
      "word": "DEMOBILIZATION",
      "definition": "Standing down a nation's armed forces from combat-ready status."
    },
    {
      "word": "SUBJUGATION",
      "definition": "The act of bringing someone or something under domination or control."
    },
    {
      "word": "ANNIHILATION",
      "definition": "Complete destruction or obliteration, often used in the context of war."
    },
    {
      "word": "OCCUPATIONFORCE",
      "definition": "A military force that occupies and controls a territory."
    },
    {
      "word": "GEOPOLITICAL",
      "definition": "Relating to politics, especially international relations, as influenced by geographical factors."
    },
    {
      "word": "DEHUMANIZATION",
      "definition": "The process of depriving a person or group of positive human qualities, often used in war propaganda."
    },
    {
      "word": "REPARATIONS",
      "definition": "Compensation imposed during peace treaties for the damage caused during war."
    },
    {
      "word": "INCARCERATION",
      "definition": "The state of being confined in prison; imprisonment, often used as a tool of political repression."
    },
    {
      "word": "EXPROPRIATION",
      "definition": "The act of a government taking privately owned property to be used for the benefit of the public."
    },
    {
      "word": "GUERRILLAWARFARE",
      "definition": "A form of irregular warfare in which small groups use military tactics to fight a larger traditional military."
    },
    {
      "word": "PSYCHOLOGICALWARFARE",
      "definition": "The use of propaganda, threats, and other psychological techniques to mislead, intimidate, or demoralize an opponent."
    },
    {
      "word": "ROGER THAT",
      "definition": "Radio communication meaning 'message received and understood.'"
    },
    {
      "word": "NO MAN'S LAND",
      "definition": "The disputed ground between the front lines of two opposing armies."
    },
    {
      "word": "FRIENDLY FIRE",
      "definition": "Weapon fire coming from one's own side, accidentally harming allies."
    },
    {
      "word": "CODE RED",
      "definition": "A state of emergency or heightened alert."
    },
    {
      "word": "COVER FIRE",
      "definition": "Gunfire provided to protect troops while they move."
    },
    {
      "word": "WAR CRIME",
      "definition": "A serious violation of the laws of war."
    },
    {
      "word": "PEACE TALKS",
      "definition": "Negotiations to end conflict or war."
    },
    {
      "word": "GROUND ZERO",
      "definition": "The point of detonation of a bomb, especially a nuclear one."
    },
    {
      "word": "RED ALERT",
      "definition": "A warning of imminent danger or attack."
    },
    {
      "word": "FALSE FLAG",
      "definition": "A covert operation designed to deceive by appearing as if carried out by another group."
    },
    {
      "word": "WAR ROOM",
      "definition": "A command center for military planning and operations."
    },
    {
      "word": "BLOOD DIAMOND",
      "definition": "A diamond mined in a war zone and sold to finance conflict."
    },
    {
      "word": "BLACK OPS",
      "definition": "Secret or covert military operations."
    },
    {
      "word": "COLD WAR",
      "definition": "A state of political hostility without direct military conflict."
    },
    {
      "word": "CIVIL WAR",
      "definition": "A war between groups within the same country."
    },
    {
      "word": "MARTIAL LAW",
      "definition": "Military government involving the suspension of ordinary law."
    },
    {
      "word": "WAR CRY",
      "definition": "A shouted word or phrase used to rally troops before battle."
    },
    {
      "word": "BATTLE FIELD",
      "definition": "The ground on which a battle is fought."
    },
    {
      "word": "CHAIN REACTION",
      "definition": "A sequence of events, often used to describe nuclear explosions."
    },
    {
      "word": "CIVIL DEFENSE",
      "definition": "Protective measures taken by civilians in case of attack."
    },
    {
      "word": "HUMAN SHIELD",
      "definition": "A person used to deter attacks by placing them in harm's way."
    },
    {
      "word": "WAR MACHINE",
      "definition": "A country's military forces and infrastructure."
    },
    {
      "word": "BATTLE AXE",
      "definition": "A large broad-bladed weapon used in combat."
    },
    {
      "word": "BLOOD FEUD",
      "definition": "A prolonged conflict between families or groups involving revenge killings."
    },
    {
      "word": "BATTLE PLAN",
      "definition": "A strategy or plan for conducting a battle."
    },
    {
      "word": "WAR CHEST",
      "definition": "Funds set aside for conducting a war or campaign."
    },
    {
      "word": "WAR HERO",
      "definition": "A person admired for bravery in war."
    },
    {
      "word": "WAR BRIDE",
      "definition": "A woman who marries a soldier during wartime."
    },
    {
      "word": "WAR DRUM",
      "definition": "A drum used to signal or motivate troops in battle."
    }
  ]
}